alefragnani.project-manager
ban.spellright
batisteo.vscode-django
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
executablebookproject.myst-highlight
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
kevinrose.vsc-python-indent
kleber-swf.unity-code-snippets
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
njpwerner.autodocstring
pkief.material-icon-theme
wholroyd.jinja